"""
Конструкція if name == 'main' використовується для того, щоб запустити код у файлі тільки тоді,
коли він запускається як головний файл програми.
Це означає, що код у цьому блоку не буде виконуватися, якщо файл імпортується як модуль у інший файл.
Це дозволяє використовувати код у файлі як модуль для імпорту в інші файли без його виконання
"""


import lecture5_modules as m
import lecture5_module as s


print('Just imported model!!!')


if __name__ == '__main__':
    print(f'My favorite student is {s.NAME} {m.LASTNAME}')
