# Створити список з 7 елементів типу int, деякі елементи повторююьтся
list_a: list = [1, 2, 3, 5, 1, 2, 3]

# Створити словник з 3 елементів: (ключі типу str: зарплата, бонус, премія) і відповідно значення: 100, 25, 50
dict_b: dict = {'salary': 100, 'bonus': 25, 'premium': 50}


# Список УНІКАЛЬНИХ елементів списку (a)
unique_list = list(set(list_a))


# Вивести суму усіх елементів списку (a)
print(sum(list_a))

# Вивести суму усіх УНІКАЛЬНИХ елементів списку (a)
print(sum(unique_list))

# Надрукувати суму елемента 3 зі списку (а), та зарплати зі словника (б)
print(int(list_a[2]) + int(dict_b['salary']))

# Надрукувати повну суму доходу на основі словника (б)
print(sum(dict_b.values()))

# Перевизначити зарплату в словнику, збільшивши її на суму премії та надрукувати результат
dict_b['salary'] += dict_b['premium']
print(dict_b['salary'])
